Repository: ecocurious2/MultiGeiger
Catalog: locales/*/LC_MESSAGES/development.po
Languages: de

source: Development
de: Entwicklung

source: This chapter will get you started with |project_name| development.
de: In diesem Kapitel werden Sie in die Entwicklung von |project_name| eingeführt.

source: |project_name| is written in C using Arduino-ESP32.
de: |project_name| ist in C geschrieben und benutzt Arduino-ESP32.

source: Contributions
de: Beiträge

source: ... are welcome!
de: ...sind willkommen!

source: Some guidance for contributors:
de: Einige Hinweise für Beitragende:

source: discuss about changes on github issue tracker
de: diskutieren Sie über Änderungen auf dem Github-Issue-Tracker

source: make your PRs against the ``master`` branch
de: machen Sie Ihre PRs gegen den ``master``-Branch

source: do clean changesets:
de: machen Sie saubere Changesets:

source: focus on some topic, resist changing anything else.
de: konzentrieren Sie sich auf ein Thema, ändern Sie nichts anderes.

source: do not do style changes mixed with functional changes.
de: machen Sie keine Stiländerungen gemischt mit funktionalen Änderungen.

source: run the automatic code formatter before committing
de: lassen Sie den automatischen Code-Formatierer laufen, bevor Sie committen

source: try to avoid refactorings mixed with functional changes.
de: versuchen Sie, Refactoring gemischt mit funktionalen Änderungen zu vermeiden.

source: if you need to fix something after commit/push:
de: wenn Sie nach dem Commit/Push etwas korrigieren müssen:

source: if there are ongoing reviews: do a fixup commit you can merge into the bad commit later.
de: wenn es laufende Überprüfungen gibt: machen Sie einen Fixup-Commit, den Sie später mit dem schlechten Commit zusammenführen können.

source: if there are no ongoing reviews or you did not push the bad commit yet: edit the commit to include your fix or merge the fixup commit before pushing.
de: Wenn es keine laufenden Überprüfungen gibt oder Sie den schlechten Commit noch nicht gepusht haben: Bearbeiten Sie den Commit, um Ihre Korrektur einzuschließen oder führen Sie ihn mit dem Fixup-Commit vor dem Pushen zusammen.

source: have a nice, clear, typo-free commit comment
de: schreiben Sie einen schönen, klaren, tippfehlerfreien Commit-Kommentar

source: if you fixed an issue, refer to it in your commit comment
de: wenn Sie ein Problem behoben haben, verweisen Sie darauf in Ihrem Commit-Kommentar

source: make a pull request on github and check on the PR page what the CI system tells about the code in your PR
de: Machen Sie einen Pull-Request auf Github und überprüfen Sie auf der PR-Seite, was das CI-System über den Code in Ihrem PR sagt

source: wait for review by other developers
de: Warten Sie auf die Überprüfung durch andere Entwickler

source: Building a development environment
de: Eine Entwicklungsumgebung aufbauen

source: Automatic Code Formatter
de: Automatischer Code-Formatierer

source: We use astyle_ for automated code formatting / formatting checks.
de: Wir verwenden astyle_ für automatische Code-Formatierung / Formatierungsprüfungen.

source: Run it like this:
de: Führen Sie es wie folgt aus:

source: Documentation
de: Dokumentation

source: Building the docs with Sphinx
de: Erstellen der Dokumentation mit Sphinx

source: Documentation is written in English and translated to other languages from that source (initially German).
de: Die Dokumentation wird in Englisch geschrieben und dann von dieser Quelle aus in andere Sprachen übersetzt (anfangs Deutsch).

source: The documentation (in reStructuredText format, .rst) is in ``docs/source/``, ``index.rst`` is the starting point there.
de: Die Dokumentation (im reStructuredText-Format, .rst) befindet sich in ``docs/source/``, ``index.rst`` ist der Startpunkt dort.

source: To build the docs, you need to have Sphinx_ installed and run:
de: Um die Dokumentation zu erstellen, müssen Sie Sphinx_ installiert haben und dies ausführen:

source: Then point a web browser at ``docs/build/html/index.html``.
de: Rufen Sie dann einen Webbrowser für ``docs/build/html/index.html`` auf.

source: The website is updated automatically by ReadTheDocs through GitHub web hooks on the main repository.
de: Die Website wird von ReadTheDocs automatisch über GitHub-Web-Hooks auf dem Haupt-Repository aktualisiert.

source: After changes of the (english) master docs, the translation master files (``*.pot``) need updating (adding/removing/updating strings in there):
de: Nach Änderungen an den (englischen) Master-Docs müssen die Übersetzungs-Masterdateien (``*.pot``) aktualisiert werden (Hinzufügen/Entfernen/Aktualisieren von Strings darin):

source: Then, these changes need to get pushed to transifex, so translators can comfortably translate on the web:
de: Dann müssen diese Änderungen nach transifex gepusht werden, damit die Übersetzer bequem im Web übersetzen können:

source: Translation is organised via [transifex](https://www.transifex.com/thomaswaldmann/multigeiger/), you need to have an account or at least login there and fire a "join team" request. Then translate the missing parts and notify the developers (e.g. via issue tracker).
de: Die Übersetzung ist auf [transifex](https://www.transifex.com/thomaswaldmann/multigeiger/) organisiert, Du brauchst dort ein Konto oder musst zumindest Dich dort einloggen und einen "Team beitreten"-Antrag absetzen. Dann die fehlenden Teile übersetzen und den Entwicklern Bescheid sagen (z. B. über den Issue Tracker).

source: Later, after translators did their part, updated translations need to get pulled from transifex:
de: Später, nachdem die Übersetzer ihren Teil erledigt haben, müssen die aktualisierten Übersetzungen von transifex gepulled werden:

source: Now we have changes in our git workdir and we need to commit them:
de: Jetzt haben wir Änderungen in unserem Git-Workdir und müssen sie committen:

source: This will trigger a build of the docs and their translation(s) on readthedocs.io.
de: Dies wird einen Build der Dokumentation und ihrer Übersetzung(en) auf readthedocs.io auslösen.

source: Flashing devices / creating binaries
de: Geräte flashen / Binärdateien erzeugen

source: do a git checkout of the wanted release, e.g. ``git checkout V1.13.0``
de: Führen Sie ein Git Checkout der gewünschten Version durch, z.B. ``git checkout V1.13.0``

source: use the default userdefines.h (available as userdefines-example.h)
de: verwenden Sie die Standard userdefines.h (verfügbar als userdefines-example.h)

source: IDE settings:
de: IDE-Einstellungen:

source: Device: Heltec WiFi Stick (always use this, even if you have a WiFi Kit 32)
de: Gerät: Heltec WiFi Stick (diesen immer verwenden, auch wenn Sie ein WiFi Kit 32 haben)

source: Flash size: 4MB (32Mb)
de: Flash-Größe: 4MB (32Mb)

source: Partition scheme: minimal SPIFFS (large APPS with OTA) - this fits onto 4MB devices.
de: Partitionsschema: minimal SPIFFS (große APPS mit OTA) - das passt auf 4MB-Geräte.

source: ``Arduino IDE -> Sketch -> Upload``
de: ``Arduino IDE -> Sketch -> Hochladen``

source: This is to test whether the compiled code actually works after USB-flashing to your device.
de: Dies ist zum Testen, ob der kompilierte Code nach dem USB-Flashen auf Ihr Gerät tatsächlich funktioniert.

source: ``Arduino IDE -> Sketch -> Export compiled binary``
de: ``Arduino IDE -> Sketch -> Kompilierte Binärdatei exportieren``

source: This creates a .bin file for OTA updating. Test whether OTA updating using that file works.
de: Dies erzeugt eine .bin-Datei für die OTA-Aktualisierung. Testen Sie, ob die OTA-Aktualisierung mit dieser Datei funktioniert.

source: Creating a new release
de: Erstellen eines neuen Releases

source: Checklist:
de: Checkliste:

source: make sure all issues for this milestone are closed or moved to the next milestone
de: Sicherstellen, dass alle Probleme für diesen Meilenstein geschlossen oder zum nächsten Meilenstein verschoben worden sind

source: check if there are any pending fixes for severe issues
de: Prüfen Sie, ob es noch ausstehende Korrekturen für schwerwiegende Probleme gibt

source: check whether some CA certificate (see ``ca_certs.h``) will expire soon and whether we already can add their next valid cert.
de: prüfen, ob ein CA-Zertifikat (siehe ``ca_certs.h``) bald abläuft und ob wir bereits deren nächstes gültiges Zertifikat hinzufügen können.

source: find and fix any low hanging fruit left on the issue tracker
de: alle einfach zu lösenden Probleme im Issue Tracker finden und beheben

source: close release milestone on Github
de: Release-Meilenstein auf Github schließen

source: update ``docs/source/changes.rst``, based on ``git log $PREVIOUS_RELEASE..``
de: Aktualisieren von ``docs/source/changes.rst``, basierend auf ``git log $PREVIOUS_RELEASE..``

source: ``bump2version --new-version 1.23.0 release`` - this will:
de: ``bump2version --new-version 1.23.0 release`` - dies wird:

source: update versions everywhere
de: die Versionen überall aktualisieren

source: auto-create a git tag
de: einen Git-Tag automatisch erstellen

source: auto-create a git commit
de: einen Git-Commit automatisch erstellen

source: review the automatically generated changeset
de: Überprüfen Sie das automatisch erzeugte Changeset

source: create a github release for this tag:
de: einen Github-Release für dieses Tag erstellen:

source: create a binary (see above) and attach to the github release
de: Erstellen Sie ein Binary (siehe oben) und hängen Sie es an den Github-Release an

source: add a link to the relevant ``changes.rst`` section to the github release
de: Fügen Sie einen Link zum relevanten ``changes.rst``-Abschnitt zum Github-Release hinzu

source: ``bump2version --no-tag --current-version 1.23.0 minor`` - this will:
de: ``bump2version --no-tag --current-version 1.23.0 minor`` - dies wird:

source: update versions everywhere (now to: 1.24.0-dev)
de: die Versionen überall aktualisieren (jetzt auf: 1.24.0-dev)

source: not quite correctly update changes.rst, will need manual fixing afterwards
de: leider nicht ganz korrekt die changes.rst aktualisieren, so dass manuelle Korrekturen danach notwendig sind

source: after fixing: git commit --amend
de: nach der Korrektur: git commit --amend
