Repository: ecocurious2/MultiGeiger
Catalog: locales/*/LC_MESSAGES/usage.po
Languages: de

source: Usage
de: Benutzung

source: Top line
de: Oberste Zeile

source: Left: Time since power-on (not shown on small displays).
de: Links: Zeit seit Einschalten (nicht auf kleinen Displays angezeigt).

source: Right: Overall average radiation since power-on.
de: Rechts: Gesamte mittlere Strahlung seit Einschalten.

source: Middle area
de: Mittlerer Bereich

source: Current CPM (counts per minute) displayed using a rather big font.
de: Aktueller CPM (Zählungen pro Minute) angezeigt in ziemlich großer Schrift

source: Bottom line
de: Untere Zeile

source: This is a status display with 8 positions, numbered 0..7:
de: Das ist eine Statusanzeige mit 8 Positionen, numeriert von 0..7:

source: Rules of thumb:
de: Faustregeln:

source: ``.`` usually means "off" or "unused".
de: ``.`` bedeutet meist "aus" oder "nicht in Gebrauch".

source: if you see some *number* (``0`` .. ``7``) within the status display line, something went wrong.
de: eine *Ziffer* (``0`` .. ``7``) im Status-Display bedeutet, dass etwas falsch ist.

source: Positions:
de: Positionen:

source: ``A``: AccessPoint active
de: ``A``: AccessPoint aktiv

source: ``w``: WiFi client trying to connect
de: ``w``: WiFi-Client versucht, sich zu verbinden

source: ``W``: WiFi client connected
de: ``W``: WiFi-Client ist verbunden

source: ``0``: some error happened
de: ``0``: ein Fehler ist aufgetreten

source: 1: sensor.community transmission
de: 1: sensor.community-Übertragung

source: ``.``: off (not configured, not enabled)
de: ``.``: aus (nicht konfiguriert / nicht aktiviert)

source: ``?``: init (enabled, before 1st transmission)
de: ``?``: Initialisierung (aktiviert, vor der 1. Übertragung)

source: ``S``: sending
de: ``S``: Senden

source: ``s``: idle (shown after successful sending)
de: ``s``: Leerlauf (wird nach erfolgreichem Senden angezeigt)

source: ``1``: sending failed (shown after trying to send)
de: ``1``: Senden fehlgeschlagen (nach Sendeversuch angezeigt)

source: 2: madavi transmission
de: 2: madavi-Übertragung

source: ``M``: sending
de: ``M``: Senden

source: ``m``: idle (shown after successful sending)
de: ``m``: Leerlauf (wird nach erfolgreichem Senden angezeigt)

source: ``2``: sending failed (shown after trying to send)
de: ``2``: Senden fehlgeschlagen (nach Sendeversuch angezeigt)

source: ``.``: off (not configured, not enabled, no LoRa hardware)
de: ``.``: aus (nicht konfiguriert, nicht aktiviert, keine LoRa Hardware)

source: ``T``: sending
de: ``T``: Senden

source: ``t``: idle (shown after successful sending)
de: ``t``: Leerlauf (wird nach erfolgreichem Senden angezeigt)

source: ``3``: sending failed (shown after trying to send)
de: ``3``: Senden fehlgeschlagen (nach Sendeversuch angezeigt)

source: ``.``: off (not enabled)
de: ``.``: aus (nicht aktiviert)

source: ``?``: init (enabled, before setup of BLE service)
de: ``?``: Initialisierung (aktiviert, vor Start des BLE-Dienstes)

source: ``B``: connected and sending notifications, if requested by connected device
de: ``B``: verbunden und sendet Benachrichtigungen, wenn es von einem verbundenen Gerät angefordert wird

source: ``b``: connectable (advertising and ready to connect)
de: ``b``: verbindbar (sichtbar und Bereit zur Verbindung)

source: ``4``: BLE error
de: ``4``: BLE-Fehler

source: 5: unused
de: 5: ungenutzt

source: 6: unused
de: 6: ungenutzt

source: 7: High-Voltage Capacitor charging
de: 7: Hochspannungskondensator laden

source: ``7``: failure to charge HV capacitor
de: ``7``: Fehler beim Laden des Hochspannungskondensators

source: ESP32 buttons
de: ESP32-Taster

source: The MultiGeiger ESP32 microcontroller board has 2 buttons:
de: Das Multigeiger-ESP32-Microcontroller-Board hat 2 Taster:

source: RST: reset (restarts device)
de: RST: Reset (startet Gerät neu)

source: PRG: program (press and hold PRG, press RST momentarily, upload firmware)
de: PRG: Program (PRG drücken und halten, dann kurz RST drücken, Firmware hochladen)

source: Often, using PRG is not needed for flashing firmware, because it "just works" when using the right tools.
de: Oft ist es nicht notwendig, PRG zum Flashen von Firmware zu benutzen, weil es auch "einfach so" funktioniert, wenn man die richtigen Werkzeuge nutzt.

source: DIP Switches
de: DIP-Schalter

source: Optionally, the MultiGeiger can be equipped with a 4-contact DIP switch under the ESP32 microcontroller board.
de: Optional kann der Multigeiger auch mit einem 4-poligen DIP-Schalter unterhalb der EPS32-Microcontroller-Platine ausgerüstet werden.

source: The firmware makes use of these 4 switches as defined in the ``Switches`` data type in ``switches.h``:
de: Die Firmware benutzt diese 4 Schalter so wie im "Switches"-Datentyp in "switches.h" definiert:

source: SW0: Speaker on
de: SW0: Lautsprecher an

source: SW1: Display on
de: SW1: Display an

source: SW2: LED on
de: SW2: LED an

source: SW3: BLE on
de: SW3: BLE an

source: BLE Heart Rate Service
de: BLE-Herzfrequenz-Dienst

source: The MultiGeiger provides a Bluetooth® Low Energy (BLE) service to allow the collection of the Geiger-Mueller count rate via a `GATT Heart Rate Service <https://www.bluetooth.com/specifications/gatt/services/>`_ (Service UUID 0x180D). The following characteristics are used:
de: Der MultiGeiger stellt einen Bluetooth® Low Energy (BLE) Dienst zur Verfügung, um die Geiger-Müller-Zählrate als einen Herzfrequenz Dienst bereitzustellen `GATT Heart Rate Service <https://www.bluetooth.com/specifications/gatt/services/>`_ (Service UUID 0x180D). Die folgenden Merkmale werden genutzt:

source: 0x2A37 ('Heart Rate Measurement Characteristic'):
de: 0x2A37 ('Merkmal Herzfrequenz-Messung'):

source: The first byte is a collection of status flags, according to the service's standard
de: Das erste Byte ist eine Sammlung von Status-Flags nach Dienststandard

source: 'Heart Rate Measurement' as 16 bit value (little endian), corresponds to Geiger-Mueller counts per minute (CPM)
de: 'Herzfrequenz-Messung' als 16 Bit Wert (little endian), entspricht dem Geiger-Müller-Zählwert pro Minute (CPM)

source: 'Energy Expenditure' as 16 bit value (little endian), represents a rolling packet counter
de: 'Energieverbrauch' als 16 Bit Wert (little endian), repräsentiert einen rollierenden Paket-Zähler

source: 0x2A38 ('Heart Rate Sensor Position Characteristic')
de: 0x2A38 ('Merkmal Herzfrequenz-Sensorposition')

source: 'Sensor Position' as 8 bit value, corresponds to TUBE-TYPE, allowing the conversion of CPM to radiation rate
de: 'Sensorposition' als 8 Bit Wert, der TUBE-TYPE entspricht, ermöglicht die Umrechnung von CPM zu Strahlungswert

source: 0x2A39 ('Heart Rate Control Point Characteristic')
de: 0x2A39 ('Merkmal Herzfrequenz-Kontrollpunkt')

source: Write characteristic, required by service's standard to reset Energy Expenditure to 0. Writing 0x01 resets the rolling packet counter to 0.
de: Beschreibbares Merkmal, benötigt nach Dienst Standard, um den Energieverbrauch auf 0 zu setzen. Schreiben von 0x01 setzt den rollierenden Paketzähler auf 0 zurück.

source: Testing BLE
de: Test BLE

source: Any decent Bluetooth® scanning app should be able to connect to the device and show the notification values.
de: Jede brauchbare Bluetooth®-Scanning-App sollte zu dem Gerät verbinden und die Werte aus den Benachrichtigungen anzeigen können.

source: The `MultiGeiger companion app <https://github.com/t-pi/multigeiger_companion>`_ was specifically made for the MultiGeiger.
de: Die `MultiGeiger companion app <https://github.com/t-pi/multigeiger_companion>`_ wurde speziell für den MultiGeiger gemacht.

source: There are also some generic apps:
de: Es gibt auch einige generische Apps:

source: Any other heart monitor app / device should be able to connect to the MultiGeiger, too.
de: Jede andere Herz-Überwachungs-App / jedes Herz-Überwachungs-Gerät sollte sich auch mit dem MultiGeiger verbinden können.

source: Figure 1: Connect to the MultiGeiger with the name 'ESP32-<id>', where <id> should be the same ID (7 to 8 digits) as with the access point to set the device up initially.
de: Abbildung 1: Verbinden Sie sich mit dem MultiGeiger mit dem Namen 'ESP32-<id>', wobei <id> die gleiche ID (7 bis 8 Ziffern) sein sollte, wie beim Access Point, um das Gerät initial einzurichten.

source: Figure 2: Find the correct service (UUID 0x180D) and, if needed, load / open characteristics.
de: Abbildung 2: Finden Sie den richtigen Dienst (UUID 0x180D) und, falls erforderlich, laden / öffnen Sie die Einstellungen.

source: Figure 3: Find the Heart Rate Measurement Characteristic (UUID 0x2A37) and click on the icon to start notifications.
de: Abbildung 3: Suchen Sie das Merkmal für die Herzfrequenzmessung (UUID 0x2A37) und klicken Sie auf das Symbol, um die Benachrichtigungen zu starten.

source: While testing, please keep in mind that an update packet is sent only every ~10s (along with a display refresh, if enabled). If a WiFi transmission is blocking display and BLE updates, the interval may be even longer. So it might take a while until a reaction with actual data can be seen in the app.
de: Bitte beachten Sie beim Testen, dass nur alle ~10s ein Update-Paket gesendet wird (zusammen mit einem Display-Update, falls aktiviert). Wenn eine WiFi-Übertragung Display- und BLE-Updates blockiert, kann das Intervall sogar noch länger sein. Es kann also eine Weile dauern, bis eine Reaktion mit aktuellen Daten in der App zu sehen ist.

source: *Fig. 1*
de: *Abb. 1*

source: *Fig. 2*
de: *Abb. 2*

source: *Fig. 3*
de: *Abb. 3*
